renesas/rx-driver-package/source/r_s12ad_rx/r_s12ad_rx_vx.xx/r_s12ad_rx/src/targets/rx23e-b/r_s12ad_rx23e-b.c
        if (p_cfg->priority_groupb > BSP_MCU_IPL_MAX)
        {
            return ADC_ERR_INVALID_ARG;
        }

        if ((0 != p_cfg->priority_groupb)   // Interrupt driven, must have callback function
        && ((NULL == p_callback) || (FIT_NO_FUNC == p_callback)))
        {
            return ADC_ERR_ILLEGAL_ARG;
        }
    }

    return ADC_SUCCESS;
} /* End of function adc_check_open_cfg() */
#endif /* ADC_CFG_PARAM_CHECKING_ENABLE == 1 */


/******************************************************************************
* Function Name: adc_control
* Description  : This function provides commands for enabling channels and
*                sensors and for runtime operations. These include enabling/
*                disabling trigger sources and interrupts, initiating a
*                software trigger, and checking for scan completion.
*
* NOTE: Enabling a channel or a sensor, or setting the sample state count reg
*       cannot be done while the ADCSR.ADST bit is set (conversion in progress).
*       Because these commands should only be called once during initialization
*       before triggers are enabled, this should not be an issue. Registers
*       with this restriction include ADANSA0, ADANSB0, 
*       ADADC, ADADS0, ADSSTRx, ADCMPCR, ADCMPANSR0,
*       ADCMPLR0, ADCMPDR0,
*       ADCMPDR1, and some bits in ADCSR, ADCMPCR, ADGSPCR.
*       No runtime operational sequence checking of any kind is performed.
*
* Arguments    : unit -
*                    Ignored for rx23e-a. Pass 0 for this argument.
*                cmd-
*                    Command to run
*                p_args-
*                    Pointer to optional configuration structure
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_MISSING_PTR-
*                    p_args pointer is FIT_NO_PTR/NULL when required as an argument
*                ADC_ERR_INVALID_ARG-
*                    cmd or element of p_args structure has invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    argument is illegal based upon rest of configuration
*                ADC_ERR_SCAN_NOT_DONE-
*                    The requested scan has not completed
*                ADC_ERR_TRIG_ENABLED -
*                    Cannot configure comparator because a scan is running
*                ADC_ERR_CONDITION_NOT_MET -
*                    No chans/sensors passed comparator condition
*                ADC_ERR_UNKNOWN
*                    Did not receive expected hardware response
*******************************************************************************/
adc_err_t adc_control(uint8_t   const   unit,
                        adc_cmd_t const   cmd,
                        void *    const   p_args)
{
    adc_err_t       err=ADC_SUCCESS;
    adc_sst_t       *p_sample;
    adc_dda_t       *p_charge;
    adc_cmpwin_t    *p_cmpwin;

    /* Get S12AD register address */
    aregs_t         *p_regs = (aregs_t *)&S12AD;
    uint32_t        flags;

    /* DO UNIVERSAL PARAMETER CHECKING */
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((NULL == p_args) || (FIT_NO_PTR == p_args))
    {
        if ((ADC_CMD_SET_DDA_STATE_CNT == cmd)
        || (ADC_CMD_SET_SAMPLE_STATE_CNT == cmd)
        || (ADC_CMD_ENABLE_CHANS == cmd)
        || (ADC_CMD_EN_COMPARATOR_LEVEL == cmd)
        || (ADC_CMD_EN_COMPARATOR_WINDOW == cmd)
        || (ADC_CMD_CHECK_CONDITION_MET == cmd))
        {
            return ADC_ERR_MISSING_PTR;
        }
    }
#endif

    /* PROCESS INDIVIDUAL COMMANDS */
    switch (cmd)
    {
        case ADC_CMD_USE_VREFH0:
            S12AD.ADHVREFCNT.BIT.HVSEL = 1;
            break;

        case ADC_CMD_USE_VREFL0:
            S12AD.ADHVREFCNT.BIT.LVSEL = 1;
            break;

        /* Set up Disconnect Detection Assist*/
        case ADC_CMD_SET_DDA_STATE_CNT:

            /* Cast from void pointer to adc_dda_t */
            p_charge = (adc_dda_t *)p_args;            //Get the command arguments
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
            if (ADC_DDA_OFF != p_charge->method)
            {

                if ((p_charge->num_states < ADC_DDA_STATE_CNT_MIN)
                || (p_charge->num_states > ADC_DDA_STATE_CNT_MAX))
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
#endif
            if (ADC_DDA_OFF == p_charge->method)
            {
                p_regs->ADDISCR.BYTE = 0;              //Disable Disconnect Detection Assist
            }
            else
            {

                /* NOTE: Using Disconnect Detection Assist adds num_states x (#chans) ADCLKS to scan time */
                p_regs->ADDISCR.BYTE = (uint8_t)((ADC_DDA_PRECHARGE == p_charge->method) ? 0x10 : 0);
                p_regs->ADDISCR.BYTE |= p_charge->num_states;
            }
            break;

        case ADC_CMD_SET_SAMPLE_STATE_CNT:

            /* Cast from void pointer to adc_sst_t */
            p_sample = (adc_sst_t *)p_args;            //Get the command arguments
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
            if (p_sample->num_states < ADC_SST_CNT_MIN)
            {
                return ADC_ERR_INVALID_ARG;
            }
#endif
            *(gp_sreg_ptrs)[p_sample->reg_id] = p_sample->num_states;
            break;

        case ADC_CMD_ENABLE_CHANS:

            /* Cast from void pointer to adc_ch_cfg_t */
            err = adc_configure_scan((adc_ch_cfg_t *)p_args);
            break;

        case ADC_CMD_EN_COMPARATOR_LEVEL:

            /* Cast from void pointer to adc_cmpwin_t */
            p_cmpwin = (adc_cmpwin_t *)p_args;
            p_regs->ADCMPCR.BIT.WCMPE = 0;          // Disable the window function. Compare level

            err = adc_en_comparator_level0(p_cmpwin);
            break;

        case ADC_CMD_EN_COMPARATOR_WINDOW:

            /* Cast from void pointer to adc_cmpwin_t */
            p_cmpwin = (adc_cmpwin_t *)p_args;
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
            if (p_cmpwin->level_lo > p_cmpwin->level_hi)
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
#endif
            p_regs->ADCMPCR.BIT.WCMPE = 1;           // Enable window function

            err = adc_en_comparator_level0(p_cmpwin);
            break;

        /* Enable A/D conversion to be started by synchronous or asynchronous trigger */
        case ADC_CMD_ENABLE_TRIG:
            p_regs->ADCSR.BIT.TRGE = 1;           // enable sync/async triggers
            break;

        /* Disable A/D conversion to be started by synchronous or asynchronous trigger */
        case ADC_CMD_DISABLE_TRIG:
            p_regs->ADCSR.BIT.TRGE = 0;           // disable sync/async triggers
            break;

        /* Start the A/D conversion process */
        case ADC_CMD_SCAN_NOW:
            if (0 == p_regs->ADCSR.BIT.ADST)
            {
                p_regs->ADCSR.BIT.ADST = 1;
            }
            else
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
            break;

        /* Check for completion of the current scan. */
        case ADC_CMD_CHECK_SCAN_DONE:
            if (1 == p_regs->ADCSR.BIT.ADST)
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
            break;

        /* Check for completion of the current scan. */
        case ADC_CMD_CHECK_SCAN_DONE_GROUPA:
            if (1 == IR(S12AD,S12ADI0))
            {
                IR(S12AD,S12ADI0) = 0;
            }
            else
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
            break;

        /* Check for completion of the current groupB scan. */
        case ADC_CMD_CHECK_SCAN_DONE_GROUPB:
            if (1 == IR(S12AD,GBADI))
            {
                IR(S12AD,GBADI) = 0;
            }
            else
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
            break;

        case ADC_CMD_CHECK_CONDITION_MET:
            flags = adc_get_and_clr_cmpi_flags();
            if (0 == flags)
            {
                err = ADC_ERR_CONDITION_NOT_MET;
            }

